Hesham-14/embedded_system/Unit 7 - MCU Pripherals/L3 - Writing Proffesional Driver/L3_lab1_GPIO_STM32F103C6_Driver/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Hesham Mohamed
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
#warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif


//#include "STM32F103x6.h"
#include "STM32F103C6_GPIO_Driver.h"



void CLK_init()
{
	//1. GPIO port A clock enable
	RCC_GPIOA_CLK_EN();
	//1. GPIO port A clock enable
	RCC_GPIOB_CLK_EN();
}

void GPIO_init()
{
	GPIO_PinConfig_t pin;

	//1. init input pin: PA1
	pin.GPIO_PinNumber = GPIO_PIN_1;
	pin.GPIO_Mode = GPIO_MODE_INPUT_FLO;
	MCAL_GPIO_Init(GPIOA, &pin);

	//2. init input pin: PA13
	pin.GPIO_PinNumber = GPIO_PIN_13;
	pin.GPIO_Mode = GPIO_MODE_INPUT_FLO;
	MCAL_GPIO_Init(GPIOA, &pin);

	//3. init output pin: PB1
	pin.GPIO_PinNumber = GPIO_PIN_1;
	pin.GPIO_Mode = GPIO_MODE_OUTPUT_PP;
	pin.GPIO_Output_Speed = GPIO_SPEED_2M;
	MCAL_GPIO_Init(GPIOB, &pin);

	//init output pin: PB13
	pin.GPIO_PinNumber = GPIO_PIN_13;
	pin.GPIO_Mode = GPIO_MODE_OUTPUT_PP;
	pin.GPIO_Output_Speed = GPIO_SPEED_2M;
	MCAL_GPIO_Init(GPIOB, &pin);
}

void wait_ms(uint32_t time)
{
	uint32_t i, j;
	for(i=0; i < time; i++)
		for(j=0; j < 255; j++);
}

int main()
{
	CLK_init();
	GPIO_init();
	while(1)
	{
		//check PA1 Press: PUR -- single press
		if( MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == 0 )
		{
			MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_1);
			while (MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == 0);
		}

		//check PA13 Press: PDR -- multi press
		if( MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_13) == 1 )
		{
			MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_13);
		}
		wait_ms(1);
	}
	return 0;
}
